[
     {
          "id": "18j3uwn",
          "forum": "spirituality",
          "title": "Maybe yall will know 🤣",
          "score": 1,
          "author": "HippieLeaf222",
          "content": "So I would say I'm a spiritual person. I like to mediate journal manifest and all that. But does anyone else deal with trying to find a balance with your ego your mind and your higher self. My boyfriend has a friend who says some offensive things. And I normally don't say anything and I try to keep the peace.  I know that it's not on his journey yet to realize what he's saying is not right. But then again I also think that I should say something because what he's saying isn't right. And this happens with a lot of other scenarios as well. \nAny advice yall got would be amazing!",
          "created_utc": 1702657367.0,
          "created": 1702657367.0,
          "url": "https://www.reddit.com/r/spirituality/comments/18j3uwn/maybe_yall_will_know/",
          "upvote_ratio": 1.0,
          "ups": 1,
          "downs": 0,
          "shortlink": "https://redd.it/18j3uwn",
          "permalink": "/r/spirituality/comments/18j3uwn/maybe_yall_will_know/",
          "view_count": null,
          "comments": 1
     },
     {
          "id": "18iy33l",
          "forum": "SpiritualAwakening",
          "title": "💭",
          "score": 5,
          "author": "MindofMine11",
          "content": "I see a lot of post on reddit of people constantly asking \"how to be more spiritual \" \" how to be enlightened.\" Like it's some sort of achievement or destination. There are spiritual practices that help on this human journey but one cannot trancend being a Human while having a Human Experience. There is no thing to achieve this constant Belief that one must act a certain way because they are \"spiritual\" or follow more norms as if society didn't have enough already. \" you cant get angry you're spiritual\" \"you cant act that way\" this type of mentality causes more harm than good to you.  it's your own mind narrating a story making you believe you have to be a certain way or you're not spiritual. one collective consciousness experiencing itself thru different life forms, there is no manual, there is no set way. Don't let the mind box you in & fill you with spiritual  labels and behaviors.",
          "created_utc": 1702639921.0,
          "created": 1702639921.0,
          "url": "https://www.reddit.com/r/SpiritualAwakening/comments/18iy33l/_/",
          "upvote_ratio": 1.0,
          "ups": 5,
          "downs": 0,
          "shortlink": "https://redd.it/18iy33l",
          "permalink": "/r/SpiritualAwakening/comments/18iy33l/_/",
          "view_count": null,
          "comments": 2
     },
     {
          "id": "18ix3do",
          "forum": "spiritual",
          "title": "Become Oneself",
          "score": 2,
          "author": "Rector418",
          "created_utc": 1702635980.0,
          "created": 1702635980.0,
          "url": "https://i.redd.it/p08h6qmwqf6c1.jpeg",
          "upvote_ratio": 0.75,
          "ups": 2,
          "downs": 0,
          "shortlink": "https://redd.it/18ix3do",
          "permalink": "/r/spiritual/comments/18ix3do/become_oneself/",
          "view_count": null,
          "comments": 0
     },
     {
          "id": "18ive76",
          "forum": "Spiritualchills",
          "title": "My story",
          "score": 3,
          "author": "Low_Helicopter_9667",
          "content": "Hi. This is my first post. I am 41 years old. I'm having frisson/chills since 14-15 years old. It started with music. Now came to the point i can have it if i want without exterior stimulus(just with a thought , not strong as with music though). It  is intensity and frequency increased over time but strongest one came around 20 years ago. It went to the point something inside my head literally hit the top, i felt it phisically. I afraid and closed the music. It was always a big mystery for me. I'm skeptic about it's nature. Is it just the brain's dopamine release or something related to spirit. I was more on the brain's product camp several years ago as an atheist at that time. But after having many interesting mystic experience for all these years that i can't explain and after researching NDE and SDE phenomenon closely I am convinced that there is something more. I feel this chills like the star of earendil that i use on a difficult life path. Still don't know what i can do more for a spiritual journey also not so sure about if we have to do anything. It looks like just being kind and loving is the right way still so hard to do in this world though. ",
          "created_utc": 1702628515.0,
          "created": 1702628515.0,
          "url": "https://www.reddit.com/r/Spiritualchills/comments/18ive76/my_story/",
          "upvote_ratio": 0.81,
          "ups": 3,
          "downs": 0,
          "shortlink": "https://redd.it/18ive76",
          "permalink": "/r/Spiritualchills/comments/18ive76/my_story/",
          "view_count": null,
          "comments": 1
     }
]